Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions
Since:
2024
Describes if the segment lengths are represented using dimensions or just as text.
Since:
2024

Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions.Dimension
Display as dimensions

Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions.Text
Display as texts